# Symlink farm manager (used by install.sh to deploy home/ -> ~)
brew "stow"
# Cross-platform make
brew "cmake"
# Fast and simple Node.js version manager
brew "fnm"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Run multiple commands in parallel
brew "mprocs"
# AI coding agent, built for the terminal
brew "opencode"
# OpenSSL based Authenticode signing for PE/MSI/Java CAB files
brew "osslsigncode"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Voice-to-text transcription and paste tool
cask "kitlangton-hex"
# Minimal GUI for AI code agents
cask "t3-code"
# Rust-based terminal
cask "warp"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "ankitbko.vscode-pull-request-azdo"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "hridoy.rails-snippets"
vscode "icsharpcode.ilspy-vscode"
vscode "marp-team.marp-vscode"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "million.million-lint"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "oven.bun-vscode"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "pomber.git-file-history"
vscode "powerquery.vscode-powerquery"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "rapidapi.vscode-services"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sanity-io.vscode-sanity"
vscode "sianglim.slim"
vscode "sleistner.vscode-fileutils"
vscode "statelyai.stately-vscode"
vscode "steoates.autoimport"
vscode "stripe.vscode-stripe"
vscode "styled-components.vscode-styled-components"
vscode "suhelmakkad.shadcn-ui"
vscode "supermaven.supermaven"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "vercel.turbo-vsc"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
cargo "cargo-bundle"
cargo "mcprocs"
